eisup_2019_docmng_integration/src/ChartsOfCharacteristicTypes/СвойстваОбъектов/СвойстваОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>СвойстваОбъектов</name>
  <comment>(Общ)</comment>
  <type>
    <types>CatalogRef.НоменклатурныеГруппы</types>
    <types>CatalogRef.Валюты</types>
    <types>CatalogRef.Проекты</types>
    <types>CatalogRef.КонтактныеЛица</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.ОсновныеСредства</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>Boolean</types>
    <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    <types>CatalogRef.абс_Продавец</types>
    <types>CatalogRef.КлассификаторСтранМира</types>
    <types>CatalogRef.Подразделения</types>
    <types>CatalogRef.Контрагенты</types>
    <types>String</types>
    <types>CatalogRef.Организации</types>
    <types>Date</types>
    <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    <types>Number</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.абс_ЦФУ</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>50</length>
    </stringQualifiers>
  </type>
  <predefined>
    <items>
      <name>ДоговорКонтрагнента_СтатьяБюджета</name>
      <description>Договор контрагнента статья бюджета</description>
      <code>00000000002</code>
      <type>
        <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
      </type>
    </items>
    <items>
      <name>ДоговорКонтрагнента_ЦФО</name>
      <description>Договор контрагнента ЦФО</description>
      <code>00000000003</code>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </items>
    <items>
      <name>ДоговорКонтрагнента_ЦФУ</name>
      <description>Договор контрагнента ЦФУ</description>
      <code>00000000004</code>
      <type>
        <types>CatalogRef.абс_ЦФУ</types>
      </type>
    </items>
    <items>
      <name>ТорговаяМарка</name>
      <description>Торговая марка</description>
      <code>00000000001</code>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>НазначениеСвойства</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.НазначенияСвойствКатегорийОбъектов</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

eisup_2019_docmng_integration/src/InformationRegisters/ЗначенияСвойствОбъектов/ЗначенияСвойствОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияСвойствОбъектов</name>
  <comment>(Общ)</comment>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/ChartsOfCharacteristicTypes/СвойстваОбъектов/ManagerModule.bsl
//+ Машута А. 24.10.2018 задача 949
Процедура ЗаписьСвойствоОбъекта(Объект, Свойство, Значение) Экспорт
	
	Запись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
	Запись.Объект = Объект;
	Запись.Значение = Значение;
	Запись.Свойство = Свойство;
	Запись.Записать();
	
КонецПроцедуры
//- Машута А. 24.10.2018 задача 949
